# Используем официальный образ Golang в качестве базового образа
FROM golang:latest

# Устанавливаем переменную окружения для обновления модулей Go при сборке
ENV GO111MODULE=on

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR C:/Users/marwq/Avito_task

# Копируем файлы go.mod и go.sum и загружаем зависимости перед копированием остальных файлов, чтобы ускорить процесс сборки
COPY go.mod go.sum ./
RUN go mod download

# Копируем все остальные файлы проекта внутрь контейнера
COPY . .

# Собираем исполняемый файл приложения
RUN go build -o main .

# Экспонируем порт 8080, на котором работает ваше приложение
EXPOSE 8080

# Команда для запуска вашего приложения при старте контейнера
CMD ["./main"]
